In [3]:
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.preprocessing import LabelEncoder

In [76]:
# df_train = pd.read_csv('Predict Future Sales/sales_train.csv').copy()
df_train = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                                    'key2':['one', 'two', 'one', 'two', 'one'],
                                    'data1':np.random.randn(5),
                                    'data2':np.random.randn(5),
                                     'data3':[0,1,0,1,0]
                                    })

In [121]:
df_train

  key1 key2     data1     data2  data3
0    a  one  0.103408  0.889814      0
1    a  two  0.102250  1.291776      1
2    b  one -0.290156  0.579237      0
3    b  two -0.373341 -0.051779      1
4    a  one -1.517420  0.489635      0

# 1、groupby
### 每组是narray类型：（name，values）（name，values）
### 两个分组名就是：（（name1,name2），values）,（（name1,name2），values）

In [78]:
df_train.groupby('key1')['key2'].sum()  # 每组value的和

key1
a    onetwoone
b       onetwo
Name: key2, dtype: object

In [79]:
df_train.groupby('key1')['key2'].size()
# df_train.groupby('key1')['key2'].size()[0]

key1
a    3
b    2
Name: key2, dtype: int64

In [80]:
df_train.groupby('key1')['key2'].transform(lambda x: print(x))

0    one
1    two
4    one
Name: a, dtype: object
2    one
3    two
Name: b, dtype: object

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
Name: key2, dtype: float64

In [81]:
df_train.groupby('key1')['key2'].transform(lambda x: print(x.name))

a
b

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
Name: key2, dtype: float64

In [82]:
df_train.groupby('key1')['key2'].transform(lambda x: print(x.values))

['one' 'two' 'one']
['one' 'two']

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
Name: key2, dtype: float64

In [83]:
df_train.groupby('key1')['key2'].transform(lambda x: print(x.size))   # 或者x.shape

3
2

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
Name: key2, dtype: float64

# 2、isna 、 isnull、info
### isna 判断不了字符串?

In [84]:
df_train.isnull()

    key1   key2  data1  data2  data3
0  False  False  False  False  False
1  False  False  False  False  False
2  False  False  False  False  False
3  False  False  False  False  False
4  False  False  False  False  False

In [85]:
df_train.isnull().sum()

key1     0
key2     0
data1    0
data2    0
data3    0
dtype: int64

In [86]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
key1     5 non-null object
key2     5 non-null object
data1    5 non-null float64
data2    5 non-null float64
data3    5 non-null int64
dtypes: float64(2), int64(1), object(2)
memory usage: 328.0+ bytes

# 3、agg

In [87]:
sales_train_subset = df_train[df_train['key1'] == 'a']
sales_train_subset.head()

  key1 key2     data1     data2  data3
0    a  one  0.103408  0.889814      0
1    a  two  0.102250  1.291776      1
4    a  one -1.517420  0.489635      0

In [122]:
grouped = df_train[['key1','key2','data1','data2','data3']].groupby(['key1','key2'])
grouped.head()
#.reset_index()

  key1 key2     data1     data2  data3
0    a  one  0.103408  0.889814      0
1    a  two  0.102250  1.291776      1
2    b  one -0.290156  0.579237      0
3    b  two -0.373341 -0.051779      1
4    a  one -1.517420  0.489635      0

In [123]:
# 经常这么用
df_train.groupby('key1')['data1'].min()

key1
a   -1.517420
b   -0.373341
Name: data1, dtype: float64

In [94]:
# 也常用
grouped.agg({'data1':'sum'})
# 对 data1 列按组求和

              data1
key1 key2
a    one  -1.414012
     two   0.102250
b    one  -0.290156
     two  -0.373341

In [102]:
grouped.agg({'sum'})
# 对每列按组求和

              data1     data2 data3
                sum       sum   sum
key1 key2
a    one  -1.414012  1.379450     0
     two   0.102250  1.291776     1
b    one  -0.290156  0.579237     0
     two  -0.373341 -0.051779     1

In [96]:
grouped.agg('sum')

              data1     data2  data3
key1 key2
a    one  -1.414012  1.379450      0
     two   0.102250  1.291776      1
b    one  -0.290156  0.579237      0
     two  -0.373341 -0.051779      1

In [137]:
grouped2 = df_train[['key1','key2','data1','data2','data3']].groupby(['key1'])
grouped2.agg({'sum'})

           key2     data1     data2 data3
            sum       sum       sum   sum
key1
a     onetwoone -1.311762  2.671226     1
b        onetwo -0.663497  0.527458     1

In [138]:
grouped2.agg('sum')
# 这种方式默认不对key2求和不知道为什么？？？

         data1     data2  data3
key1
a    -1.311762  2.671226      1
b    -0.663497  0.527458      1

In [140]:
# 修改列名
grouped2.agg('sum').rename(columns={'data1':'datan'})
# grouped2 = grouped2.agg('sum').rename(columns={'data1':'datan'})
# grouped2.head()

         datan     data2  data3
key1
a    -1.311762  2.671226      1
b    -0.663497  0.527458      1